-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 26, 2023 at 07:20 PM
-- Server version: 10.4.6-MariaDB
-- PHP Version: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `newsdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `cate_new`
--

CREATE TABLE `cate_new` (
  `cate_id` int(3) UNSIGNED ZEROFILL NOT NULL,
  `cate_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cate_new`
--

INSERT INTO `cate_new` (`cate_id`, `cate_name`) VALUES
(001, 'ข่าวบันเทิง'),
(002, 'ข่าวการเมือง');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(6) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสข่าว',
  `title` text NOT NULL COMMENT 'หัวข้อ/ไฮไลฟ์',
  `times` datetime NOT NULL COMMENT 'วันเวลา',
  `img` text NOT NULL COMMENT 'รูปภาพ',
  `txtMessage` varchar(2000) NOT NULL COMMENT 'เนื้อหา',
  `cate` int(3) NOT NULL COMMENT 'ประเภทข่าว'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `title`, `times`, `img`, `txtMessage`, `cate`) VALUES
(000006, '“วราวุธ” ไม่ขัดข้อง หาก “ทักษิณ” กลับไทย แต่ต้องรับโทษตามกฎหมาย', '0000-00-00 00:00:00', '142336138720230326_172949.jpg', '<p>&ldquo;วราวุธ&rdquo; สนับสนุน &ldquo;ทักษิณ&rdquo; กลับไทยรับโทษตามกฎหมาย มองการกลับมาอาจกระทบต่อคะแนนเสียงเลือกตั้ง</p>\r\n\r\n<p>นายวราวุธ ศิลปอาชา หัวหน้าพรรคชาติไทยพัฒนา ได้ให้สัมภาษณ์ภายหลังจากจบปราศรัย กล่าวขอบคุณพ่อแม่พี่น้องทุกคนที่มาเวทีปราศรัยในวันนี้ และพูดถึงเงื่อนไขของการร่วมรัฐบาลหลังการเลือกตั้งทั่วไปว่า พรรคชาติไทยพัฒนามี 2 เงื่อนไขสำคัญคือ จะไม่แตะต้องมาตรา 112 และเอานโยบายที่ได้นำเสนอไว้อย่างว้าว&hellip;ไทยแลนด์ การแก้ไขรัฐธรรมนูญโดยการร่างรัฐธรรมนูญฉบับใหม่ การดูแลพี่น้องเกษตรกรรวมไปถึงงบท้องถิ่น ที่จะต้องไม่ต่ำกว่า 10 ล้าน ถ้าเงื่อนไขเหล่านี้สามารถดำเนินการได้ เราก็จะทำงานร่วมกันในฐานะพรรคร่วมรัฐบาล และถ้าขั้วไหนรับนโยบายของชทพ.ไปทำงาน ก็มีโอกาสเข้าไปร่วมรัฐบาลด้วย</p>\r\n', 0),
(000007, '\"ดิว อริสรา\" โพสต์ภาพ \"น้องไซลาส\" แต่ทำหลุดโฟกัสใบ้เลขเด็ดเต็มๆ', '0000-00-00 00:00:00', '139442220920230326_213339.jpg', '<p>ใกล้แล้วที่คุณแม่ลูกหนึ่ง<strong>&nbsp;ดิว อริสรา</strong>&nbsp;จะบินกลับมาเมืองไทย แต่ช่วงนี้ถึงครอบครัวจะยังอยู่ที่ไต้หวัน แต่<strong>&nbsp;แม่ดิว</strong>&nbsp;ก็ไม่ลืมที่จะโพสต์รูปน่ารักๆ ของ&nbsp;<strong>น้องไซลาส</strong>&nbsp;ลูกชายสุดที่รักของ ดิว และ เซบาสเตียน ซึ่งนอกจากดิวจะหลงลูกหนักมากแล้ว พี่ๆ ที่เห็นรูปก็หลงน้องไปด้วย</p>\r\n\r\n<p>โดยล่าสุด&nbsp;<strong>ดิว อริสรา</strong>&nbsp;ได้โพสต์ภาพลูกชาย&nbsp;<strong>น้องไซลาส</strong>&nbsp;ที่กำลังนอนกินนมจากขวด พร้อมกับส่งรอยยิ้มทำหน้าตาน่ารัก พร้อมกับแคปชั่นว่า&nbsp;<strong>&quot;With my whole heart for my whole life...มือน้อยๆ ของต้าวก้อน #silasezralee&quot;</strong></p>\r\n\r\n<p>ซึ่งงานนี้ก็ทำเอาหลายคนหลุดโฟกัสที่ความน่ารักและความหล่อของ&nbsp;<strong>น้องไซลาส</strong>&nbsp;แต่ไปโฟกัสที่นิ้วมือน้อยๆ ของน้อง ที่หลายคนก็แอบตีเป็นเลขเด็ดตามๆ กัน คอมเมนต์กันใหญ่เลย เช่น</p>\r\n\r\n<p>งานนี้ทำเอาแฟนๆ โฟกัสที่ท่าทางการยกนิ้วมือของน้องไซลาสกันยกใหญ่ แถมยังตีเป็นเลขเด็ดกันด้วย เช่น&nbsp;บอกงวดหน้าแน่ๆ,เลข1กับเลขอะไรดีครับ,น่ารัก,10 กับ 14 คนคอ<a href=\"https://news.sanook.com/lotto/\" target=\"_blank\">หวย</a>อย่างเรา,เลข 1 ต้องมาไหมคร๊าบบบบ,งวดนี้เลข 1 มาแน่ พวกพี่ๆขออีก 2 ตัวได้ไหมฮับ พี่ซ็อต,10 แนๆเลยน้อนครับ,51 01 051,1 ใช่ไหมลูก,ใบ้หวยอีกแล้ว พ่อไมโครเวฟไซลาสส,ได้แม่สุดๆ555,รูป3ขี้นิ้วด้วย อิอิ,บ้หวยให้ป้าซะแล้ว น่ารักจังลูก,งวดนี้ 10 นะค้าบ,เดี๋ยวนี้ยิ้มเก่งเอ็นดู,13 ต้องเข้าแล้ว ต้าวก้อน,งวดนี้มีเลขหนึ่ง น้องใบ้เเบบ</p>\r\n', 0),
(000009, 'เล่นดีจบไม่คม! \"มาโน\" รับผิดหวังก่อนนำ \"ทัพช้างศึก\" ลงซ้อมทันทีหลังถึงยูเออี', '0000-00-00 00:00:00', '80536001720230326_231846.jpg', '<p><strong><a href=\"https://www.sanook.com/sport/\" target=\"_blank\">ฟุตบอล</a>ชายทีมชาติไทยชุดใหญ่ ฝึกซ้อมต่อเนื่องเพื่อเตรียมความพร้อมก่อนการแข่งขันฟุตบอลอุ่นเครื่องตามปฏิทินฟีฟ่าเดย์ กับทีมชาติสหรัฐอาหรับเอมิเรตส์ ที่ ซอคเกอร์ ซิตี้ กรุงอาบูดาบี เมื่อวันอาทิตย์ที่ 26 มีนาคม 2566</strong><br />\r\n<br />\r\nในการฝึกซ้อมครั้งนี้ มาโน โพลกิง หัวหน้าผู้ฝึกสอน ได้แบ่งนักเตะเป็น 2 ชุด คือ กลุ่ม 11 ตัวจริง ที่ลงเล่นกับทีมชาติซีเรีย ฟื้นฟูร่างกายที่ห้องฟิตเนสโรงแรม ส่วนนักเตะที่เหลือฝึกซ้อมตามปกติ โดยผู้เล่นอย่าง ชนาธิป สรงกระสินธ์ ,ธีราทร บุญมาทัน ศุภชัย ใจเด็ด ,พีรดนย์ ฉ่ำรัศมี ฟื้นฟูร่างกายที่สนามฝึกซ้อม ใช้เวลา 1 ชั่วโมง เน้นฝึกซ้อมการเล่นร่วมกันและการจบสกอร์<br />\r\n<br />\r\nก่อนการฝึกซ้อม มาโน โพลกิง เฮดโค้ชทีมชาติไทยกล่าวว่า &ldquo;มันเป็นสกอร์ที่น่าผิดหวัง จริงแล้วมันเป็นเกมที่เราเล่นได้ดี เป็นเกมที่พวกเราทำงานหนักทุกคน และก็สมควรจะได้ผลสกอร์ที่ดีกว่านี้ เราครองเกมได้ทำเกมได้ดีเพียงแต่ว่า ผลลัพท์ไม่ได้ออกมาตามที่เราต้องการ ต้องทำงานหนักและมีสมาธิกันต่อไป&rdquo;<br />\r\n<br />\r\n&ldquo;เหลืออีกเกมนึงก็บอกแล้วว่า 2 เกมนี้มันเป็นบททดสอบของเราที่เราจะได้รู้ว่า สู้กับคู่ต่อสู้ที่อันดับดีกว่า เราได้หรือเปล่า จริงๆ เกมเมื่อวานก็ทำให้เราเห็นว่า เราสู้ได้ ต้องไปตัดข้อผิดพลาดออกไปจากเรา และทำให้ดีกว่านี้ในเกมถัดไป&rdquo;</p>\r\n', 0),
(000010, '', '0000-00-00 00:00:00', '', '', 0),
(000011, '', '0000-00-00 00:00:00', '', '', 0),
(000012, '', '0000-00-00 00:00:00', '', '', 0),
(000013, 'เปลี่ยนขุมกำลัง! เรอัล มาดริด พร้อมกระชาก \"แนวรุกอาร์เซน่อล\" ร่วมทัพซีซั่นหน้า', '0000-00-00 00:00:00', '112234411420230326_234935.jpg', '<p><strong>&quot;ราชันชุดขาว&quot; เรอัล มาดริด ยักษ์ใหญ่แห่งศึก ลา ลีกา กำลังพิจารณาหากองหน้าคนใหม่ที่จะเข้ามารับตำแหน่งต่อจาก คาริม เบนเซม่า โดยมีชื่อของ กาเบรียล เชซุส ดาวยิงอาร์เซน่อล เป็นแคนดิเดตสำคัญ จากการรายงานของ ดิเฟนซา เซนทรัล สื่อดังของสเปน</strong><br />\r\n<br />\r\nสตาร์วัย 35 ปีเพิ่งคว้ารางวัลบัลลงดอร์ มาได้ในครั้งล่าสุดจากผลงานอันยอดเยี่ยมที่พาทีมเป็นแชมป์ ลา ลีกา และ ยูฟ่า แชมเปี้ยนส์ลีก เมื่อซีซั่นก่อนโดยยิงไป 44 ประตูจากการลงเล่น 47 นัด อย่างไรก็ตามในซีซั่นนี้แม้จะยังคงยิงประตูได้อย่างต่อเนื่องโดยทำไปแล้ว 19 ประตูจาก 29 นัดแต่เจ้าตัวก็มีอาการบาดเจ็บเล่นงานอยู่เป็นระยะ<br />\r\n<br />\r\nในขณะเดียวกันสัญญาของ เบนเซม่า กำลังจะหมดลงหลังจบฤดูกาลนี้ และทาง เรอัล มาดริด หวังจะทำการขยายสัญญาออกไปอีก 1 ปี รวมทั้งการมองหาผู้เล่นหน้าใหม่ที่จะเข้ามาสืบทอดตำแหน่งของเขาในฤดูกาลหน้าด้วย</p>\r\n', 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cate_new`
--
ALTER TABLE `cate_new`
  ADD PRIMARY KEY (`cate_id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(6) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT COMMENT 'รหัสข่าว', AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
